# COMP3115: Exploratory Data Analysis and Visualization
# Lab 3 Excercise on Data Preprocessing

Student Name: Yu Fengfei

Student Number: 21251215

### Q1. Load the 'loan.csv' into a Pandas DataFrame called df. Get general information of this data frame (e.g., number of non-null values, data type etc).

In [198]:
import pandas as pd
from sklearn import preprocessing

In [199]:
data = pd.read_csv('loan.csv')
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [200]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

### Q2. Remove uniformatic Column 'Loan_ID' from df

In [201]:
data_removed = data.copy()
data_removed = data_removed.drop(['Loan_ID'], axis=1)
data_removed.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

### Q3. Fill the missing values in columns 'Gender', 'Married' , 'Dependents' and 'Self_Employed' by Mode

In [202]:
data_filled = data_removed.copy()
data_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             601 non-null    object
 1   Married            611 non-null    object
 2   Dependents         599 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      582 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

In [203]:
data_filled['Gender'].fillna(data_filled['Gender'].dropna().mode()[0], inplace=True)
data_filled['Married'].fillna(data_filled['Married'].dropna().mode()[0], inplace=True)
data_filled['Dependents'].fillna(data_filled['Dependents'].dropna().mode()[0], inplace=True)
data_filled['Self_Employed'].fillna(data_filled['Self_Employed'].dropna().mode()[0], inplace=True)

data_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

### Q4. Fill the missing values in column 'Loan_Amount_Term' by median

In [204]:
data_filled['Loan_Amount_Term'].fillna(data_filled['Loan_Amount_Term'].median(), inplace=True)
data_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

### Q5. Fill the missing values in column 'Credit_History' by mean

In [205]:
data_filled['Credit_History'].fillna(data_filled['Credit_History'].mean(), inplace=True)
data_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

### Q6. Fill the missing values in column 'LoanAmount' by the mean amount of each {'Gender', 'Married' and 'Self_Employed'} group.

In [206]:
data_grouped = data_filled.copy()

grouped_mean = data_grouped.groupby(['Gender', 'Married', 'Self_Employed'])['LoanAmount'].transform('mean')

data_grouped['LoanAmount'] = data_grouped['LoanAmount'].fillna(grouped_mean)

data_grouped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

### Q7. Mapping the Ordinal Feature 'Dependents' to numeric by: '0'->0, '1'->1, '2'->2, '3+' -> 3

In [207]:
data_mapped = data_grouped.copy()

data_mapped['Dependents'] = data_mapped['Dependents'].map({'0': 0, '1': 1, '2': 2, '3+': 3}).astype(int)

data_mapped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    int32
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int32(1), int64(1), object(6)
memory usage: 55.3+ KB

### Q8. Mapping nomial features 'Gender', 'Married', 'Education'  and 'Self_Employed ' to numeric features.
- 'Gender': 'Male'->0, 'Female'->1
- 'Married': 'Yes'->0, 'No'->1 
- 'Education':'Graduate' -> 0, 'Not Graduate '->1
- 'Self_Employed': 'Yes' -> 0, 'No' -> 1

In [208]:
data_mapped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    object
 1   Married            614 non-null    object
 2   Dependents         614 non-null    int32
 3   Education          614 non-null    object
 4   Self_Employed      614 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int32(1), int64(1), object(6)
memory usage: 55.3+ KB

In [209]:
data_mapped['Gender'] = data_mapped['Gender'].map({'Male': 0, 'Female': 1}).astype(int)
data_mapped['Married'] = data_mapped['Married'].map({'Yes': 0, 'No': 1}).astype(int)
data_mapped['Education'] = data_mapped['Education'].map({'Graduate': 0, 'Not Graduate': 1}).astype(int)
data_mapped['Self_Employed'] = data_mapped['Self_Employed'].map({'Yes': 0, 'No': 1}).astype(int)

data_mapped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    int32
 1   Married            614 non-null    int32
 2   Dependents         614 non-null    int32
 3   Education          614 non-null    int32
 4   Self_Employed      614 non-null    int32
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int32(5), int64(1), object(2)
memory usage: 45.7+ KB

### Q9. One-hot encoding for 'Property_Area' column and drop original 'Property_Area' from df

In [210]:
one_hot_encoded = pd.get_dummies(data_grouped['Property_Area'])
data_mapped = data_mapped.join(one_hot_encoded)
data_mapped = data_mapped.drop(['Property_Area'], axis=1)

data_mapped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    int32
 1   Married            614 non-null    int32
 2   Dependents         614 non-null    int32
 3   Education          614 non-null    int32
 4   Self_Employed      614 non-null    int32
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Loan_Status        614 non-null    object
 11  Rural              614 non-null    bool
 12  Semiurban          614 non-null    bool
 13  Urban              614 non-null    bool
dtypes: bool(3), float64(4), int32(5), int64(1), object(1)
memory usage: 42.7+ KB

### Q10. Apply Z-score normalization to columns 'ApplicantIncome' and 'CoapplicantIncome'

In [213]:
z_score_scaler = preprocessing.StandardScaler()

data_normalized_z_score = z_score_scaler.fit_transform(data_mapped.loc[:, (data_mapped.columns == 'ApplicantIncome') | (data_mapped.columns == 'CoapplicantIncome')])

data_normalized_z_score = pd.DataFrame(data_normalized_z_score, columns=['ApplicantIncome', 'CoapplicantIncome'])

data_final = data_mapped.drop(['ApplicantIncome', 'CoapplicantIncome'], axis=1).join(data_normalized_z_score)

data_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    int32
 1   Married            614 non-null    int32
 2   Dependents         614 non-null    int32
 3   Education          614 non-null    int32
 4   Self_Employed      614 non-null    int32
 5   LoanAmount         614 non-null    float64
 6   Loan_Amount_Term   614 non-null    float64
 7   Credit_History     614 non-null    float64
 8   Loan_Status        614 non-null    object
 9   Rural              614 non-null    bool
 10  Semiurban          614 non-null    bool
 11  Urban              614 non-null    bool
 12  ApplicantIncome    614 non-null    float64
 13  CoapplicantIncome  614 non-null    float64
dtypes: bool(3), float64(5), int32(5), object(1)
memory usage: 42.7+ KB

In [214]:
data_final.head()

,Gender,Married,Dependents,Education,Self_Employed,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Rural,Semiurban,Urban,ApplicantIncome,CoapplicantIncome
0,0,1,0,0,1,129.936937,360.0,1.0,Y,False,False,True,0.072991,-0.554487
1,0,0,1,0,1,128.000000,360.0,1.0,N,True,False,False,-0.134412,-0.038732
2,0,0,0,0,0,66.000000,360.0,1.0,Y,False,False,True,-0.393747,-0.554487
3,0,0,0,1,1,120.000000,360.0,1.0,Y,False,False,True,-0.462062,0.251980
4,0,1,0,0,1,141.000000,360.0,1.0,Y,False,False,True,0.097728,-0.554487